
win_x, win_y = 200, 100
win_width, win_height = 1400, 600
txt_title = "Прогресс Трек"
#окно 1
txt_hello = '''
Добро пожаловать в приложение, которое поможет тебе организовать свои
тренировки, отслеживать прогресс и достигать поставленных целей! Мы предлагаем
ебе простой и удобный способ сделать фитнес частью твоей жизни.

Забудь о сложных программах и трате времени на поиск упражнений. У нас ты найдешь
10 тщательно разработанных этапов тренировок, каждый из которых направлен на
разные группы мышц и цели. В каждом этапе тебя ждут 4 эффективных упражнения, из
которых ты можешь выбрать то, которое подходит тебе больше всего.

'''

txt_next = 'Начать'

txt_question = '''Готов начать свой путь к здоровому и сильному телу? Просто выбери первый этап
тренировки и начни двигаться к своей цели уже сегодня! Твой успех в твоих руках!'''

txt_instruction = '''ЧТО ТЫ ПОЛУЧИШЬ С НАШИМ ПРИЛОЖЕНИЕМ:

Персонализированный подход: Выбирай упражнения, которые нравятся именно тебе, и устанавливай индивидуальные цели по количеству повторений или времени выполнения.

Удобный трекинг: Отслеживай продолжительность каждой тренировки, количество сожженных калорий и свой прогресс в целом.

Разнообразие и мотивация: Меняй этапы тренировок, пробуй новые упражнения и оставайся мотивированным на пути к своим фитнес-целям.

Простота и удобство: Интуитивно понятный интерфейс и простая навигация позволят тебе быстро начать тренироваться без лишних усилий.'''


#окно 2
txt_resume = "Продолжить"
#этап 1
txt_1ex1 = "Жим штанги лежа (различные углы, если есть возможности) "
txt_1ex2 = "Жим гантелей на наклонной скамье."
txt_1ex3 = "Разведение гантелей лежа."
txt_1ex4 = "Сведение рук в тренажере (бабочка)"
txt_2nfo = " Здесь должно быть время вида 0, 0, 0"
txt_1nfo = "Колличество вписать в последние число вида 0, 0, 0"
#этап 2
txt_2ex1 = "Подтягивания (или тяга верхнего блока)."
txt_2ex2 = "Тяга штанги в наклоне."
txt_2ex3 = "Тяга гантели в наклоне (каждой рукой по очереди)."
txt_2ex4 = "Тяга нижнего блока к поясу."
#этап 3
txt_3ex1 = "Приседания со штангой (или жим ногами в тренажере)."
txt_3ex2 = "Выпады с гантелями."
txt_3ex3 = "Становая тяга на прямых ногах."
txt_3ex4 = "Ягодичный мостик (с весом или без)."
#этап 4
txt_4ex1 = "Жим гантелей сидя."
txt_4ex2 = "Разведение гантелей в стороны стоя."
txt_4ex3 = "Разведение гантелей в наклоне (для задних дельт)."
txt_4ex4 = "Тяга штанги к подбородку."
#этап 5
txt_5ex1 = "Сгибание рук со штангой стоя."
txt_5ex2 = "Сгибание рук с гантелями на скамье Скотта."
txt_5ex3 = "Сгибание рук с гантелями молотковым хватом."
txt_5ex4 = "Концентрированное сгибание рук с гантелей."
#этап 6
txt_6ex1 = "Бег (на улице или на беговой дорожке)."
txt_6ex2 = "Велосипед."
txt_6ex3 = "Плавание."
txt_6ex4 = "Эллиптический тренажер."

#окно 3 


#окно 4
txt_age = " "
txt_finalwin =" "
txt_index = " "
txt_workheart = " "
txt_res1 = " "
txt_res2 = " "
txt_res3 = " "
txt_res4 = " "
txt_res5 = " "
txt_timers = "Старт"